<template>
  <div class="tip">
    <!-- usual department -->
    <div class="department">
      <div class="header">
        <div class="left">
          <svg
            t="1715009261689"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="4826"
            width="32"
            height="32">
            <path
              d="M128 224a96 96 0 0 1 96-96h352a96 96 0 0 1 96 96v64h128a96 96 0 0 1 96 96v416a96 96 0 0 1-96 96H224a96 96 0 0 1-96-96V224z m544 128v64h138.656a21.344 21.344 0 0 0 21.344-21.344c0-23.552-19.104-42.656-42.656-42.656H672z m160 160a32 32 0 0 0-32-32h-128v64h128a32 32 0 0 0 32-32z m0 128a32 32 0 0 0-32-32h-128v224h96a64 64 0 0 0 64-64v-128z m-224 192V256a64 64 0 0 0-64-64H256a64 64 0 0 0-64 64v512a64 64 0 0 0 64 64v-96a64 64 0 0 1 64-64h128a64 64 0 0 1 64 64v96h96z m-160 0v-64a32 32 0 0 0-32-32h-64a32 32 0 0 0-32 32v64h128z m-32-416v64a32 32 0 1 1-64 0v-64H288a32 32 0 1 1 0-64h64V288a32 32 0 1 1 64 0v64h64a32 32 0 1 1 0 64h-64z"
              fill="#d81e06"
              p-id="4827"></path>
          </svg>
          <span>常见科室</span>
        </div>
        <div class="right">
          <span>全部</span>
          <svg
            t="1715008318799"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="3196"
            width="16"
            height="16">
            <path
              d="M266.605714 877.129143a68.973714 68.973714 0 0 0 3.291429 97.572571 78.994286 78.994286 0 0 0 107.958857 0L809.545143 571.245714a68.973714 68.973714 0 0 0 19.602286-68.169143 68.900571 68.900571 0 0 0-19.602286-68.169142L377.856 31.670857a78.994286 78.994286 0 0 0-107.958857 0 68.973714 68.973714 0 0 0 0 100.790857L666.624 503.222857 269.897143 873.837714a69.046857 69.046857 0 0 0-1.682286 1.609143z"
              fill="#707070"
              p-id="3197"></path>
          </svg>
        </div>
      </div>
      <div class="content">
        <ul>
          <li>神经内科</li>
          <li>消化内科</li>
          <li>呼吸内科</li>
          <li>内科</li>
          <li>儿科</li>
          <li>神经外科</li>
          <li>妇科</li>
          <li>产科</li>
        </ul>
      </div>
    </div>

    <!-- web notice -->
    <div class="notice">
      <div class="header">
        <div class="left">
          <svg
            t="1715009525289"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="5995"
            width="32"
            height="32">
            <path
              d="M521.8304 198.912l-223.104 127.4624-98.2272 0.0256A57.6 57.6 0 0 0 142.8992 384v256l0.128 3.9424a57.6 57.6 0 0 0 57.472 53.6576l98.176-0.0256 223.1552 127.5136a57.6 57.6 0 0 0 86.1952-49.9968V248.9088a57.6 57.6 0 0 0-86.1952-49.9968z m22.1696 61.0304v504.0896l-228.2752-130.432-108.8512-0.0256v-243.2l108.8512 0.0256 228.2752-130.4576zM653.952 371.0208a32 32 0 0 1 44.8512-5.9648c42.1376 32.2304 63.3088 79.488 63.3088 138.624s-21.1712 106.3936-63.3088 138.624a32 32 0 0 1-38.8864-50.8416c25.5488-19.5328 38.1952-47.7696 38.1952-87.808 0-40.0128-12.6464-68.224-38.1952-87.7824a32 32 0 0 1-5.9648-44.8512z"
              fill="#1296db"
              p-id="5996"></path>
            <path
              d="M723.9168 261.7088a32 32 0 0 1 44.8512-5.9648c74.8288 57.216 112.3328 140.9024 112.3328 247.936 0 107.008-37.504 190.72-112.3328 247.936a32 32 0 1 1-38.8864-50.8416c58.24-44.544 87.2192-109.2096 87.2192-197.12 0-87.8848-28.9792-152.5504-87.2192-197.0944a32 32 0 0 1-5.9648-44.8512z"
              fill="#1296db"
              p-id="5997"></path>
          </svg>
          <span>平台公告</span>
        </div>
        <div class="right">
          <span>全部</span>
          <svg
            t="1715008318799"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="3196"
            width="16"
            height="16">
            <path
              d="M266.605714 877.129143a68.973714 68.973714 0 0 0 3.291429 97.572571 78.994286 78.994286 0 0 0 107.958857 0L809.545143 571.245714a68.973714 68.973714 0 0 0 19.602286-68.169143 68.900571 68.900571 0 0 0-19.602286-68.169142L377.856 31.670857a78.994286 78.994286 0 0 0-107.958857 0 68.973714 68.973714 0 0 0 0 100.790857L666.624 503.222857 269.897143 873.837714a69.046857 69.046857 0 0 0-1.682286 1.609143z"
              fill="#707070"
              p-id="3197"></path>
          </svg>
        </div>
      </div>
      <div class="content">
        <ul>
          <li>·关于延长北京大学国际医院...</li>
          <li>·北京中医药大学东方医院部...</li>
          <li>·武警总医院号源暂停更新通知...</li>
        </ul>
      </div>
    </div>

    <!-- notice two -->
    <div class="noticeTwo">
      <div class="header">
        <div class="left">
          <svg
            t="1715010225491"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="6296"
            width="32"
            height="32">
            <path
              d="M342 391.1h24.7v180.4H342z"
              fill="#f4ea2a"
              p-id="6297"></path>
            <path
              d="M404.6 711.5c-0.4 3.7-0.6 7.5-0.6 11.2v70c0 59.7 48.4 108 108 108 59.7 0 108-48.4 108-108v-70c0-3.8-0.2-7.5-0.6-11.2H404.6z m0 0"
              fill="#f4ea2a"
              p-id="6298"></path>
            <path
              d="M512 923.9c-72.3 0-131.1-58.8-131.1-131.1v-70c0-4.5 0.2-9.1 0.7-13.6 1.2-11.8 11.1-20.7 23-20.7h214.9c11.8 0 21.8 8.9 23 20.7 0.5 4.5 0.7 9.1 0.7 13.6v70c-0.1 72.3-58.9 131.1-131.2 131.1z m-84.9-189.3v58.1c0 46.8 38.1 84.9 84.9 84.9 46.8 0 84.9-38.1 84.9-84.9v-58.1H427.1z m148-477.2c-0.8 0-1.6 0-2.4-0.1-12.7-1.3-21.9-12.7-20.6-25.4 0.1-1.4 0.2-2.8 0.2-4.2v-41.1c0-22.2-18.1-40.3-40.3-40.3-22.2 0-40.3 18.1-40.3 40.3v41.1c0 1.4 0.1 2.8 0.2 4.2 1.3 12.7-7.9 24.1-20.6 25.4-12.7 1.3-24.1-7.9-25.4-20.6-0.3-3-0.5-6-0.5-9v-41.1c0-47.7 38.8-86.5 86.5-86.5s86.5 38.8 86.5 86.5v41.1c0 3-0.2 6-0.5 9-1.1 11.9-11.1 20.7-22.8 20.7z m0 0"
              fill="#f4ea2a"
              p-id="6299"></path>
            <path
              d="M756.7 616.9c-12.8 0-23.1-10.3-23.1-23.1V481.3c0-122.2-99.4-221.6-221.6-221.6-122.2 0-221.6 99.4-221.6 221.6v112.5c0 12.8-10.3 23.1-23.1 23.1s-23.1-10.3-23.1-23.1V481.3c0-147.7 120.2-267.8 267.8-267.8 147.7 0 267.9 120.2 267.9 267.8v112.5c0 12.8-10.4 23.1-23.2 23.1z m0 0"
              fill="#f4ea2a"
              p-id="6300"></path>
            <path
              d="M168.3 677h687.5v113.6H168.3z"
              fill="#f4ea2a"
              p-id="6301"></path>
            <path
              d="M855.7 813.7H168.3c-12.8 0-23.1-10.3-23.1-23.1V677c0-12.8 10.3-23.1 23.1-23.1h687.5c12.8 0 23.1 10.4 23.1 23.1v113.6c0 12.8-10.4 23.1-23.2 23.1z m-664.3-46.2h641.3v-67.4H191.4v67.4z m0 0"
              fill="#f4ea2a"
              p-id="6302"></path>
          </svg>
          <span>停诊通知</span>
        </div>
        <div class="right">
          <span>全部</span>
          <svg
            t="1715008318799"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="3196"
            width="16"
            height="16">
            <path
              d="M266.605714 877.129143a68.973714 68.973714 0 0 0 3.291429 97.572571 78.994286 78.994286 0 0 0 107.958857 0L809.545143 571.245714a68.973714 68.973714 0 0 0 19.602286-68.169143 68.900571 68.900571 0 0 0-19.602286-68.169142L377.856 31.670857a78.994286 78.994286 0 0 0-107.958857 0 68.973714 68.973714 0 0 0 0 100.790857L666.624 503.222857 269.897143 873.837714a69.046857 69.046857 0 0 0-1.682286 1.609143z"
              fill="#707070"
              p-id="3197"></path>
          </svg>
        </div>
      </div>
      <div class="content">
        <ul>
          <li>·中国人民解放军总医院第六...</li>
          <li>·首都医科大学附属北京潞河...</li>
          <li>·中日友好医院中西医结合心...</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">
.tip {
  .department {
    color: #7f7f7f;
    .header {
      display: flex;
      justify-content: space-between;
      div {
        display: flex;
        align-items: center;
        span {
          margin-left: 5px;
        }
      }
    }
    .content {
      margin-bottom: 60px;
      ul {
        margin-left: 10px;
        display: flex;
        flex-wrap: wrap;
        justify-content: space-between;
        li {
          width: 40%;
          margin-top: 15px;
          font-size: 15px;
        }
      }
    }
  }

  .notice {
    color: #7f7f7f;
    .header {
      display: flex;
      justify-content: space-between;
      div {
        display: flex;
        align-items: center;
        span {
          margin-left: 5px;
        }
      }
    }
    .content {
      margin-bottom: 60px;
      ul {
        margin-left: 10px;
        display: flex;
        flex-wrap: wrap;
        justify-content: space-between;
        li {
          width: 100%;
          margin-top: 15px;
          font-size: 13px;
        }
      }
    }
  }

  .noticeTwo {
    color: #7f7f7f;
    .header {
      display: flex;
      justify-content: space-between;
      div {
        display: flex;
        align-items: center;
        span {
          margin-left: 5px;
        }
      }
    }
    .content {
      margin-bottom: 40px;
      ul {
        margin-left: 10px;
        display: flex;
        flex-wrap: wrap;
        justify-content: space-between;
        li {
          width: 100%;
          margin-top: 15px;
          font-size: 13px;
        }
      }
    }
  }
}
</style>
